In [2]:
import sqlite3
import pandas as pd

In [3]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [4]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [5]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
for i in ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX']:
    print(f" select '{i}' as column_name, count(*) as cnt_nulls from boston where {i} is null union")

 select 'CRIM' as column_name, count(*) as cnt_nulls from boston where CRIM is null union
 select 'ZN' as column_name, count(*) as cnt_nulls from boston where ZN is null union
 select 'INDUS' as column_name, count(*) as cnt_nulls from boston where INDUS is null union
 select 'CHAS' as column_name, count(*) as cnt_nulls from boston where CHAS is null union
 select 'NOX' as column_name, count(*) as cnt_nulls from boston where NOX is null union

In [8]:
tasks+=1
pd.read_sql(
    ''' 
    select 'CRIM' as column_name, count(*) as cnt_nulls from boston where CRIM is null union
    select 'ZN' as column_name, count(*) as cnt_nulls from boston where ZN is null union
    select 'INDUS' as column_name, count(*) as cnt_nulls from boston where INDUS is null union
    select 'CHAS' as column_name, count(*) as cnt_nulls from boston where CHAS is null union
    select 'NOX' as column_name, count(*) as cnt_nulls from boston where NOX is null
    ''',
    con,
    
)

  column_name  cnt_nulls
0        CHAS          0
1        CRIM          0
2       INDUS          0
3         NOX          0
4          ZN          0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [9]:
tasks+=1
pd.read_sql(
    '''
    select 'CRIM' as column_name, count(distinct CRIM) as cnt_dist from boston union
    select 'ZN' as column_name, count(distinct ZN) as cnt_dist from boston union
    select 'INDUS' as column_name, count(distinct INDUS) as cnt_dist from boston union
    select 'CHAS' as column_name, count(distinct CHAS) as cnt_dist from boston union
    select 'NOX' as column_name, count(distinct NOX) as cnt_dist from boston 
    ''',
    con,
)

  column_name  cnt_dist
0        CHAS         2
1        CRIM       504
2       INDUS        76
3         NOX        81
4          ZN        26

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [10]:
tasks+=1
pd.read_sql(
    '''select column_name,med from 
    (with a as
        (
            select CRIM as value , 'CRIM' as column_name, ROW_NUMBER() OVER(ORDER BY CRIM) ROW_N , min(CRIM) over() as min_val from boston union
            select ZN as value , 'ZN' as column_name, ROW_NUMBER() OVER(ORDER BY ZN) ROW_N , min(ZN) over() as min_val from boston union
            select INDUS as value , 'INDUS' as column_name, ROW_NUMBER() OVER(ORDER BY INDUS) ROW_N , min(INDUS) over() as min_val from boston union
            select CHAS as value , 'CHAS' as column_name, ROW_NUMBER() OVER(ORDER BY CHAS) ROW_N , min(CHAS) over() as min_val from boston union
            select NOX as value , 'NOX' as column_name, ROW_NUMBER() OVER(ORDER BY NOX) ROW_N , min(NOX) over() as min_val from boston
        )
        select distinct column_name,min_val,avg(value) over(partition by column_name) as med from a 
        where row_n in (253,254)) 
    where min_val = med
    ''',
    con,
)

# –ù–µ –¥–æ –∫–æ–Ω—Ü–∞ –ø–æ–Ω—è–ª —Ü–µ–ª—å –∑–∞–¥–∞–Ω–∏—è. –í—ã–≤–µ–ª –Ω–∞–∑–≤–∞–Ω–∏—è –∫–æ–ª–æ–Ω–æ–∫, —É –∫–æ—Ç–æ—Ä—ã–π –º–µ–¥–∏–∞–Ω–∞ = –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ. –°–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ –±–æ–ª—å—à–µ –ø–æ–ª–æ–≤–∏–Ω—ã –¥–æ–º–æ–≤ –Ω–µ –≥—Ä–∞–Ω–∏—á–∞—Ç —Å —Ä–µ–∫–æ–π –∏ 
# –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤. —Ç–∞–∫ –∂–µ –æ—Ç—Å—É—Ç—Å—Ç–≤—É–µ—Ç
#

  column_name  med
0        CHAS  0.0
1          ZN  0.0

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [11]:
tasks+=1
pd.read_sql(
    '''
    select 
        distinct criter,
        (select avg(rm) from boston where medv = (select max(medv) from boston)) avg_rm_max_medv,
        avg (rm) over(partition by criter) avg_rm_criter,
        (select avg(rm) from boston where medv = (select max(medv) from boston)) -avg (rm) over(partition by criter) dif_avg_rm 
        from (
            SELECT medv,rm, 
                case
                when row_number() over(ORDER BY MEDV) <= 25 then 'bot_25'
                when row_number() over(ORDER BY MEDV) <= 50 then 'bot_50'
                when row_number() over(ORDER BY MEDV) <= 100 then 'bot_100'
                when row_number() over(ORDER BY MEDV) <= 200 then 'bot_200'
                when row_number() over(ORDER BY MEDV) <= 300 then 'bot_300'
                else "dorogo_bogato" 
                end criter from boston
                )
    where criter !='dorogo_bogato'
    order by dif_avg_rm desc
    ''',
    con,
)

# –≤–ª–∏—è–Ω–∏–µ —á–∏—Å–ª–∞ –∫–æ–º–Ω–∞—Ç –æ—á–µ–Ω—å –∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ–µ , 
#—Ç.–∫ —Ä–∞–∑–Ω–∏—Ü–∞ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–æ–∏–º —Å–µ–≥–º–µ–Ω—Ç–æ–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º, –≤—Å–µ–≥–æ 1.7 –µ–¥–∏–Ω–∏—Ü—ã

    criter  avg_rm_max_medv  avg_rm_criter  dif_avg_rm
0   bot_25            7.484        5.74784     1.73616
1   bot_50            7.484        5.75864     1.72536
2  bot_200            7.484        5.93629     1.54771
3  bot_100            7.484        6.02100     1.46300
4  bot_300            7.484        6.09327     1.39073

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [12]:
tasks+=1
pd.read_sql(
    '''select * from
    (
        select lstat,medv, rank() over (order by lstat) rank from boston
        )
    where medv = (select max(medv) from boston)
    ''',
    con,
)
# –æ—á–µ–≤–∏–¥–Ω–æ, —á—Ç–æ –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö –¥–æ–º–∞—Ö –ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–ª–µ–Ω–∏—è —Å –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å –Ω–∏–∂–µ,—á–µ–º –≤ –¥—Ä—É–≥–∏—Ö.
# –ù–æ –Ω–µ–ª—å–∑—è —Å–∫–∞–∑–∞—Ç—å, —á—Ç–æ —Ç–æ–ª—å–∫–æ –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö –Ω–∞–∏–º–µ–Ω—à–∏–π –ø—Ä–æ—Ü–µ–Ω—Ç —Ç–∞–∫–æ–≥–æ –Ω–∞—Å–µ–ª–µ–Ω–∏—è]

    lstat  medv  rank
0    1.73  50.0     1
1    1.92  50.0     2
2    2.88  50.0     6
3    2.96  50.0     8
4    2.97  50.0     9
5    3.16  50.0    15
6    3.26  50.0    17
7    3.32  50.0    18
8    3.70  50.0    26
9    3.73  50.0    27
10   4.45  50.0    41
11   4.63  50.0    50
12   5.12  50.0    67
13   7.44  50.0   141
14   8.88  50.0   181
15   9.53  50.0   203

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT distinct avg(MEDV) OVER (PARTITION BY CHAS) as 'MEDV_avg',
    CASE 
    WHEN CHAS = 1 then '–ì—Ä–∞–Ω–∏—á–∏—Ç_—Å_—Ä–µ–∫–æ–π' 
    ELSE '–ù–µ_–≥—Ä–∞–Ω–∏—á–∏—Ç_—Å_—Ä–µ–∫–æ–π' 
    END as CHAS_type
    FROM boston
  
    ''',
    con,
)

    MEDV_avg            CHAS_type
0  22.093843  –ù–µ_–≥—Ä–∞–Ω–∏—á–∏—Ç_—Å_—Ä–µ–∫–æ–π
1  28.440000     –ì—Ä–∞–Ω–∏—á–∏—Ç_—Å_—Ä–µ–∫–æ–π

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [14]:
for i in ['CRIM', 'ZN', 'INDUS', 'NOX']:
    print(f" select '{i}' as column_name count(1) from target where {i} > avg_{i} and chas = 1 group by {'column_name'} union")

 select 'CRIM' as column_name count(1) from target where CRIM > avg_CRIM and chas = 1 group by column_name union
 select 'ZN' as column_name count(1) from target where ZN > avg_ZN and chas = 1 group by column_name union
 select 'INDUS' as column_name count(1) from target where INDUS > avg_INDUS and chas = 1 group by column_name union
 select 'NOX' as column_name count(1) from target where NOX > avg_NOX and chas = 1 group by column_name union

In [15]:
# –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π
tasks+=1
pd.read_sql(
    '''
    with target as
        (
            select CRIM , avg(CRIM) over() avg_crim,ZN , avg(ZN) over() avg_zn,indus , avg(indus) over() avg_indus ,nox , avg(nox) over() avg_nox,chas from boston
            )
    select 'CRIM' as column_name, count(1) as cnt from target where CRIM > avg_CRIM and chas = 1 group by column_name union
    select 'ZN' as column_name, count(1) from target where ZN > avg_ZN and chas = 1 group by column_name union
    select 'INDUS' as column_name, count(1) from target where INDUS > avg_INDUS and chas = 1 group by column_name union
    select 'NOX' as column_name, count(1) from target where NOX > avg_NOX and chas = 1 group by column_name
    ''',
    con,
)

# '''–ì—Ä–∞–Ω–∏—Ü–∞ —Å —Ä–µ–∫–æ–π –ø–æ–ª–æ–∂–∏—Ç–µ–ª—å–Ω–æ –≤–ª–∏—è–µ—Ç –Ω–∞ —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏, –∞ —Ç–∞–∫ –∂–µ –Ω–∞ –∫–æ–Ω—Ü–µ—Ç—Ä–∞—Ü–∏—é –æ–∑–æ—Ç–∞
#   –∫–æ–ª–ª–∏—á–µ—Å—Ç–≤–æ –æ–±—ä–µ–∫—Ç–æ–≤, –≥–¥–µ –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –±–æ–ª—å—à–µ —Å—Ä–µ–¥–Ω–µ–π –ø–æ—á—Ç–∏ –≤ 11 —Ä–∞–∑ –º–µ–Ω—å—à–µ, —á–µ–º –∫–æ–≥–¥–∞ –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π
# –°–∏—Ç—É—Ü–∏–π –∫–æ–≥–¥–∞ –ø–æ–∫–∞–∑–∞—Ç–µ–ª—å ZN –±–æ–ª—å—à–µ —Å—Ä–µ–¥–Ω–µ–π –ø—Ä–∏ –≥—Ä–∞–Ω–∏—Ü—ã —Å —Ä–µ–∫–æ–π –≤ 18 —Ä–∞–∑ –º–µ–Ω—å—à–µ, —á–µ–º –∫–æ–≥–¥–∞ –Ω–µ—Ç Chas = 0

  column_name  cnt
0        CRIM    7
1       INDUS   18
2         NOX   15
3          ZN    7

In [16]:
# –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π
tasks+=1
pd.read_sql(
    '''
    with target as
        (
            select CRIM , avg(CRIM) over() avg_crim,ZN , avg(ZN) over() avg_zn,indus , avg(indus) over() avg_indus ,nox , avg(nox) over() avg_nox,chas from boston
            )
    select 'CRIM' as column_name, count(1) as cnt from target where CRIM > avg_CRIM and chas = 0 group by column_name union
    select 'ZN' as column_name, count(1) from target where ZN > avg_ZN and chas = 0 group by column_name union
    select 'INDUS' as column_name, count(1) from target where INDUS > avg_INDUS and chas = 0 group by column_name union
    select 'NOX' as column_name, count(1) from target where NOX > avg_NOX and chas = 0 group by column_name
    ''',
    con,
)

  column_name  cnt
0        CRIM  120
1       INDUS  194
2         NOX  194
3          ZN  127

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [17]:
for i in (10,20,30,40,50,60,70,80,90,100):
    print(f'select avg(nox) as avg_nox ,avg(indus) as avg_indus , max(pers) as pers from table_1 where pers <={i} union')

select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=10 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=20 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=30 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=40 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=50 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=60 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=70 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=80 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=90 union
select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=100 union

In [18]:
tasks+=1
pd.read_sql(
    ''' with table_1 as (
        SELECT nox, indus , ntile(100) over(order by nox,indus) as pers
        from boston
        )
     select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=10 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=20 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=30 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=40 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=50 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=60 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=70 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=80 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=90 union
    select avg(nox) avg_nox ,avg(indus) avg_indus , max(pers) as pers from table_1 where pers <=100
    ''',
    con,
)
# –µ—Å—Ç—å —è–≤–Ω–∞—è –∫–æ—Ä—Ä–µ–ª—è—Ü–∏—è –º–µ–∂–¥—É Indus –∏ NOX

    avg_nox  avg_indus  pers
0  0.409505   3.681964    10
1  0.421752   5.019151    20
2  0.432613   5.206923    30
3  0.447693   5.512379    40
4  0.462011   5.949258    50
5  0.476172   6.606176    60
6  0.492362   8.265225    70
7  0.509748   9.363374    80
8  0.529958  10.321338    90
9  0.554695  11.136779   100

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [19]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ